  {
  "batchcomplete": "",
  "warnings": {
    "extracts": {
      "*": "\"exlimit\" was too large for a whole article extracts request, lowered to 1.\nHTML may be malformed and/or unbalanced and may omit inline images. Use at your own risk. Known problems are listed at https://www.mediawiki.org/wiki/Extension:TextExtracts#Caveats."
    }
  },
  "query": {
    "pages": {
      "4338589": {
        "pageid": 4338589,
        "ns": 0,
        "title": "OpenClassrooms",
        "extract": "<p class=\"mw-empty-elt\">\n</p>\n<p><b>OpenClassrooms</b> est un site web de formation en ligne qui propose à ses membres des cours certifiants et des parcours débouchant sur des métiers en croissance. Ses contenus sont réalisés en interne, par des écoles, des universités, des entreprises partenaires comme Microsoft ou IBM, ou historiquement par des bénévoles. Jusqu'en 2018, n'importe quel membre du site pouvait être auteur, via un outil nommé « interface de rédaction » puis « Course Lab ». De nombreux cours sont issus de la communauté, mais ne sont plus mis en avant. Initialement orientée autour de la programmation informatique, la plate-forme couvre depuis 2013 des thématiques plus larges tels que le marketing, l'entrepreneuriat et les sciences.\n</p><p>Créé en 1999 sous le nom de <b>Site du Zéro</b>, il se forme essentiellement sur la base de contributions de bénévoles proposant des tutoriels vulgarisés avec un ton léger portant sur des sujets informatiques divers. À la suite du succès et de la fin des études des gérants, l'entreprise Simple IT, renommée ensuite OpenClassrooms, est fondée dans le but de pérenniser le site. Celle-ci base son modèle économique sur la délivrance de certifications payantes et propose un abonnement pour être suivi par un mentor<sup class=\"reference cite_virgule\">,</sup>. Suite à ces changements, des utilisateurs créent un site web aux buts similaires, dont les auteurs et l'association le gérant sont uniquement bénévoles et ne propose pas de certifications (Zeste de Savoir).\n</p>\n\n<h2><span id=\"Fonctionnement\">Fonctionnement</span></h2>\n<p>Le site propose un catalogue de plus de 1 000 tutoriels accessibles en ligne. Ceux-ci sont en majorité des cours texte sur le développement informatique, bien que depuis 2014 un certain nombre de tutoriels vidéo commencent à être publiés sur des thématiques connexes (entrepreneuriat, webmarketing, sciences, etc.). Depuis ses débuts, le site se veut accessible à tous et vise en particulier les débutants.\n</p>\n<h3><span id=\"En_tant_que_lecteur\">En tant que lecteur</span></h3>\n<p>Chaque lecteur peut décider de suivre les tutoriels seul en autonomie gratuitement ou bien d'être accompagné par un mentor. Le cours peut être consulté par chapitres ou en entier et le lecteur peut réaliser les exercices demandés, qui peuvent prendre la forme de quiz ou d'activités corrigées entre pairs. Ces dernières permettent à chacun de rendre des réponses au quiz qui seront corrigées par d'autres lecteurs sur la plateforme.\n</p><p>L'assimilation du tutoriel est considéré comme réussie lorsque le lecteur parvient à obtenir plus de 70 % de bonnes réponses sur l'ensemble du cours. La plupart des tutoriels publiés ou mis à jour depuis 2014 délivrent des certificats de réussite lorsque l'élève est membre Premium. Certains de ces certificats sont délivrés directement par OpenClassrooms, d'autres <span title=\"Ce passage manque de clarté ; plus de précisions sont nécessaires.\">en partenariat</span><sup class=\"need_ref_tag\" style=\"padding-left:2px;\">[précision nécessaire]</sup> avec des écoles et universités (Polytechnique, Centrale Paris, ESG...).\n</p><p>Une fois le tutoriel terminé, le lecteur peut choisir de continuer sur un nouveau cours au sein de son parcours ou bien réaliser un projet avec l'aide de son mentor.\n</p>\n<h3><span id=\"En_tant_que_r.C3.A9dacteur\"></span><span id=\"En_tant_que_rédacteur\">En tant que rédacteur</span></h3>\n<p>Avant avril 2018, tout visiteur pouvait créer un cours avec l'aide de l'éditeur de cours proposé sur le site. Celui-ci était soumis à une validation pédagogique par l'équipe d'OpenClassrooms au sein d'un espace nommé CourseLab. Les tutoriels jugés meilleurs étaient suivis et pré-traités par une personne de l'équipe éditoriale d'OpenClassrooms. Ils étaient ensuite publiés en ligne sur le site pour la plupart sous la licence Creative Commons <i>Paternité / Pas d'utilisation commerciale / Partage des conditions initiales à l'identique</i>. Depuis, les cours crées par les visiteurs ne sont plus mis en avant, au profit de ceux rédigés par l'équipe OpenClassrooms, des écoles ou des entreprises partenaires.\n</p><p>50 % des revenus générés par les membres Premium sur chaque cours sont reversés aux ex-rédacteurs ou à l'institution.\n</p><p>Certaines personnes, auteurs de cours ou non, choisissent d'aider les lecteurs en prenant le rôle d'aide personnalisée, dit mentor. Ils les accompagnent sur une durée allant de plusieurs semaines à plusieurs mois afin de les guider à travers les cours et des projets pratiques.\n</p>\n<h2><span id=\"Histoire\">Histoire</span></h2>\n<p>Le concept du site naît en 1999 sous le nom de Site du Zéro. Mathieu Nebra, alors collégien de 13 ans en classe de <abbr class=\"abbr\" title=\"Quatrième\">4<sup>e</sup></abbr>, cherche à créer son propre site web. Déçu de ne pas trouver de livres adaptés pour les débutants en librairie, il décide d'écrire lui-même le cours qu'il aurait aimé lire. Destiné à quelques amis à l'origine, le site grandit par bouche à oreille et se dote de forums collaboratifs et de nouveaux cours. Il connaîtra en particulier un essor important au début des années 2000 avec un cours sur la création de cartes en 3D pour le jeu Half-Life. \n</p><p>De la rencontre en 2002 entre Mathieu Nebra et Pierre Dubuc, alors visiteur du site, naît une longue collaboration. Ils développent une nouvelle version du site qui sera publiée en 2005. Elle pose de nouvelles bases : chaque visiteur peut créer un compte et rédiger ses propres cours. Ceux-ci ne sont publiés qu'après validation et relecture par un comité bénévole de membres experts.\n</p><p>Face au succès grandissant du site, Mathieu et Pierre fondent une start-up nommée Simple IT en 2007 peu avant la fin de leurs études à l'EFREI. Ils y travaillent tous les deux à temps plein à partir de 2009 pour faire évoluer le site.\n</p><p>Début 2013, une nouvelle version du site est lancée afin de faire face à la dette technique grandissante de la version précédente, démarrée il y a près de 10 ans. En septembre de la même année, le site et l'entreprise sont tous deux renommés en OpenClassrooms. Les objectifs annoncés de ce changement de nom sont l'internationalisation ainsi que l'ouverture à un plus large public sur de nouvelles thématiques.\n</p><p>Depuis 2015, des parcours assemblant plusieurs cours sont proposés aux visiteurs. Ils suggèrent un certain ordre de lecture des cours pour parvenir à réussir un projet ou à s'orienter vers un nouveau métier. En <time class=\"nowrap date-lien\" datetime=\"2015-06\" data-sort-value=\"2015-06\">juin 2015</time>, OpenClassrooms ouvre le premier titre professionnel de niveau II reconnu par l'État français entièrement en ligne en partenariat avec l'IESA Multimédia, identique à une école traditionnelle.\n</p><p>En 2015, le site déclare compter 1 million de comptes depuis sa création, ainsi qu'un trafic de 2,5 millions de visiteurs uniques par mois. La même année, l'abonnement <span lang=\"en\">Premium</span> est proposé gratuitement à tous les demandeurs d'emplois français, en partenariat avec Pôle emploi et le gouvernement.\n</p><p>En 2016, Openclassrooms a commencé à mettre en place des parcours, une suite de cours et d'exercices pratiques appelés \"projets\", donnant suite pour certaines de ces formations, à un diplôme reconnu par l'État français. Un abonnement Premium Plus est requis pour pouvoir suivre un parcours. \n</p>\n<ul class=\"gallery mw-gallery-traditional\"><li class=\"gallerycaption\">Évolution de la page d'accueil du site web au fil des versions</li>\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n</ul><h2><span id=\"Notori.C3.A9t.C3.A9\"></span><span id=\"Notoriété\">Notoriété</span></h2>\n<p>En 2011, le site est classé <abbr class=\"abbr\" title=\"Dixième\">10<sup>e</sup></abbr> site high-tech préféré des français par Harris Interactive dans le classement NetObserver. En 2014, il est également classé <abbr class=\"abbr\" title=\"Quarante-deuxième\">42<sup>e</sup></abbr> dans le Deloitte In Extenso Fast Technology 50 qui récompense les entreprises technologiques à forte croissance. On le retrouve en 2015 dans le classement du magazine Wired “Europe’s Hottest startups”.\n</p><p>Le MIT Technology Review délivre en 2015 à Mathieu Nebra le prix <i><span lang=\"en\">MIT Innovator under 35 France</span></i>, récompensant les jeunes de moins de 35 ans dont les travaux innovants ont ou vont avoir un impact conséquent sur la société, pour son travail sur OpenClassrooms.\n</p><p>En <time class=\"nowrap date-lien\" datetime=\"2015-04\" data-sort-value=\"2015-04\">avril 2015</time>, le président français François Hollande, en visite d'État en Suisse, annonce que tous les demandeurs d'emploi en France seront éligibles à un compte premium OpenClassrooms gratuit à partir de <time class=\"nowrap date-lien\" datetime=\"2015-09\" data-sort-value=\"2015-09\">septembre 2015</time>. Les détails du fonctionnement de cette offre ne sont pas communiqués.\n</p><p>Enfin, OpenClassrooms est invité deux fois au festival SXSW à Austin, Texas, pour représenter l'opération marketing « French Tech » et donner une conférence intitulée <span lang=\"anglais\"><q><span>Students take the power back!</span></q></span><sup class=\"reference cite_virgule\">,</sup><sup class=\"reference cite_virgule\">,</sup>.\n</p>\n<h2><span id=\"Controverses\">Controverses</span></h2>\n<p>Au lancement de la version 4, le site a effectué un repositionnement pour s’adresser à un public international sur des thématiques plus larges. Ce repositionnement a été une source de tensions entre administrateurs et l'équipe bénévole du site, n’adhérant pas à cette nouvelle vision. Une partie d'entre eux a démissionné en signe de protestation. Les administrateurs demanderont la signature d'une charte de bonne conduite aux bénévoles restants. Le site et le forum ayant évolué, le statut honorifique de Zéros d'Honneurs attribué à certains membres (incluant d'anciens bénévoles) sera supprimé et un groupe Staff sera créé. OpenClassrooms se professionnalise et développe des offres premium pour adapter son modèle d'affaire à ses ambitions. L’aspect communautaire étant toujours présent, les étudiants sont invités à renseigner leurs profils pour échanger sur les forums et trouver l’aide appropriée.\n</p><p>Ce repositionnement mène une partie de l’équipe bénévole démissionnaire à créer en 2014 un nouveau site nommé Zeste de savoir<sup class=\"reference cite_virgule\">,</sup>.\n</p><p>Le code du projet CLAIRE de LMS conçu par OpenClassrooms et des laboratoires de recherche, démarré comme un projet Open Source, ne sera pas diffusé publiquement dans sa globalité en raison de difficultés techniques. Le code source est toutefois à disposition des partenaires qui travaillent avec OpenClassrooms et en font la demande. Par ailleurs, les travaux sur l'édition de contenu rich-media, basés sur un fork de Popcorn Maker, sont diffusés.\n</p>\n<h2><span id=\"L.27entreprise\"></span><span id=\"L'entreprise\">L'entreprise</span></h2>\n<p>L'entreprise OpenClassrooms (précédemment connue sous le nom de Simple IT) est lancée en 2007 par Mathieu Nebra et Pierre Dubuc, alors seuls actionnaires. À son lancement, l'entreprise est composée uniquement de ses deux fondateurs, en fin d'études de l'INSA de Lyon et de l'EFREI, qui décident de consacrer leur vie professionnelle au Site du Zéro.\n</p><p>Les premiers salariés à temps plein rejoignent l'entreprise en 2009. Celle-ci occupera successivement des bureaux à Bourg-la-Reine, puis dans Paris <abbr class=\"abbr\" title=\"Neuvième\">9<sup>e</sup></abbr> rue le Peletier, puis au boulevard Haussmann et enfin dans Paris <abbr class=\"abbr\" title=\"Dixième\">10<sup>e</sup></abbr> cité Paradis en 2014<sup class=\"reference cite_virgule\">,</sup>.\n</p><p>L'actionnariat s'étend en février 2012 avec l'arrivée au capital du fonds d'investissement Alven Capital. L'entreprise lève alors 1,2 million d'euros afin de soutenir la croissance de son activité<sup class=\"reference cite_virgule\">,</sup><sup class=\"reference cite_virgule\">,</sup>. Une nouvelle levée de fonds de 1 million d'euros suivra en janvier 2014, toujours avec Alven Capital<sup class=\"reference cite_virgule\">,</sup></p><p>L'entreprise occupe aujourd'hui près de 300 <abbr class=\"abbr\" title=\"mètre carré\">m<sup>2</sup></abbr> de bureaux cité Paradis dans le <abbr class=\"abbr\" title=\"Dixième\">10<sup>e</sup></abbr> arrondissement de Paris. Elle compte une centaine de salariés à temps plein.\n</p>\n<ul class=\"gallery mw-gallery-traditional\"><li class=\"gallerybox\" style=\"width: 155px\">\n\t\t<li class=\"gallerybox\" style=\"width: 155px\">\n</ul><h3><span id=\"Mod.C3.A8le_.C3.A9conomique\"></span><span id=\"Modèle_économique\">Modèle économique</span></h3>\n<p>OpenClassrooms a connu plusieurs business models différents pour rentabiliser son activité, centrée autour de tutoriels gratuits et ouverts en ligne.\n</p><p>Si historiquement le site était un projet hobbyiste de Mathieu Nebra, il a depuis le début des années 2000 été financé par la publicité, dont le retrait progressif a été annoncé lors de la seconde levée de fonds de janvier 2014.\n</p><p>En parallèle de la publicité, une collection de livres papier voit le jour. Elle comprend plus de 20 ouvrages, vendus en ligne sur le site, dans les librairies et sur des boutiques en ligne comme Amazon. La collection sera par la suite déclinée en eBooks.\n</p><p>Depuis 2013, l'entreprise se dirige vers un modèle freemium. Un abonnement Premium à 20 <abbr class=\"abbr\" title=\"euro\">€</abbr> par mois permet d'obtenir des certificats en ligne et d'accéder à tout le catalogue d'eBooks d'OpenClassrooms, mais aussi à plus d'une centaine d'eBooks d'Eyrolles et Dunod. Un abonnement <span lang=\"en\">Premium Plus</span> à 300 <abbr class=\"abbr\" title=\"euro\">€</abbr> par mois permet d'être suivi par un mentor privé par visioconférence et d'obtenir le titre professionnel reconnu par l'État.\n</p><p>OpenClassrooms vend par ailleurs des prestations d'ingénierie pédagogique à destination des établissements scolaires et entreprises qui souhaitent créer des cours en ligne<sup class=\"reference cite_virgule\">,</sup>.\n</p><p>Le chiffre d'affaires réalisé a évolué de 175 000 <abbr class=\"abbr\" title=\"euro\">€</abbr> en 2009 aux débuts de l'entreprise à 1 200 000 <abbr class=\"abbr\" title=\"euro\">€</abbr> en 2012<sup class=\"reference cite_virgule\">,</sup>. Depuis 2013, ces chiffres ne sont plus communiqués.\n</p>\n<h3><span id=\"Architecture_technique\">Architecture technique</span></h3>\n<p>Depuis ses débuts, le site est développé en PHP. Conçu autour d'un framework maison au début des années 2000 qui sera utilisé tout au long de la version 3 du site, il est refondu pour utiliser le framework Symfony lors du lancement de la version 4.\n</p><p>Après avoir initialement utilisé une base de données MySQL, l'équipe décide de migrer en 2005 vers une base de données PostgreSQL qu'elle utilise encore à ce jour. De la même façon, après avoir initialement utilisé le gestionnaire de version SVN, l'équipe passe à Git courant 2008.\n</p><p>Le site a connu plusieurs hébergeurs : d'un hébergement personnel Infonie à ses tout débuts, il passe chez OVH en hébergement dédié en 2002. Pour soutenir l'évolution du site, Mathieu lance un appel aux dons afin d'acheter un serveur dédié, puis un second appel aux dons un an plus tard pour les mêmes besoins.\n</p><p>Le site aura été hébergé la majorité du temps par Din'Hosting sur la base de serveurs dédiés en cloud privé. Il aura connu quelques brefs passages par l'hébergement Gandi et l'hébergement Heroku.\n</p><p>Depuis juin 2015, toute l'architecture technique est hébergée sur des serveurs virtuels dédiés Amazon Web Services.\n</p>\n<h3><span id=\"Audience\">Audience</span></h3>\n<p>Fin 2013, selon Alexa, OpenClassrooms.com était le <abbr class=\"abbr\" title=\"Quatre-vingt-quinzième (nonante-cinquième)\">95<sup>e</sup></abbr> site le plus visité de France<sup class=\"reference cite_virgule\">,</sup>. Selon une interview de Pierre Dubuc au Journal du Net réalisée en <time class=\"nowrap date-lien\" datetime=\"2013-10\" data-sort-value=\"2013-10\">octobre 2013</time>, OpenClassrooms serait visité par 2,4 millions de visiteurs uniques, aurait 650 000 membres inscrits, offrirait 800 cours, et son forum contiendrait 8 millions de messages. \n</p><p>En <time class=\"nowrap date-lien\" datetime=\"2015-03\" data-sort-value=\"2015-03\">mars 2015</time>, OpenClassrooms annonce avoir atteint le chiffre du million de comptes créés.\n</p>\n<h2><span id=\"Annexes\">Annexes</span></h2>\n<h3><span id=\"Articles_connexes\">Articles connexes</span></h3>\n<ul><li>Formation en ligne</li>\n<li>Formation en ligne ouverte à tous (MOOC)</li>\n<li>Coursera</li>\n<li>EdX</li>\n<li>Zeste de savoir</li></ul><h3><span id=\"Liens_externes\">Liens externes</span></h3>\n<ul><li><abbr class=\"abbr indicateur-langue\" title=\"Langue : français\">(fr)</abbr> Site officiel</li>\n<li><abbr class=\"abbr indicateur-langue\" title=\"Langue : français\">(fr)</abbr> Blog de l'entreprise</li></ul><h2><span id=\"Notes_et_r.C3.A9f.C3.A9rences\"></span><span id=\"Notes_et_références\">Notes et références</span></h2>\n<p><br></p><ul id=\"bandeau-portail\" class=\"bandeau-portail\"><li><span><span></span> <span>Portail de l’informatique</span> </span></li> <li><span><span></span> <span>Portail d’Internet</span> </span></li> <li><span><span></span> <span>Portail de la programmation informatique</span> </span></li> <li><span><span></span> <span>Portail des sciences</span> </span></li> <li><span><span></span> <span>Portail de l’éducation</span> </span></li> <li><span><span></span> <span>Portail des entreprises</span> </span></li>               </ul>"
      }
    }
  }
}